[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:13:33
 import { useNavigate } from "react-router-dom";
 import { hasRole } from "main/utils/currentUser";
 
-function formatDate(dateString) {
-  return new Date(dateString).toLocaleDateString();
-}
+function formatDate(dateString) {}
 
 export default function RecommendationRequestTable({ requests, currentUser }) {

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:54:52
   // ADDING NEW STATTUS BUTTONS FOR PROFESSORS: Accept and Deny (for PENDING requests), 
   // and Completed (for ACCEPTED requests)
   const acceptCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "ACCEPTED" });
+    statusUpdateMutation.mutate({ cell, newStatus: "" });
     window.location.reload(); // refresh the page
   };

[Survived] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:64:33
   };
 
   const completeCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "COMPLETED" });
+    statusUpdateMutation.mutate({});
     window.location.reload();
   };

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:101:5
       Header: "Status",
       accessor: "status",
     },
-    {
-      Header: "Submission Date",
-      accessor: "submissionDate",
-      // turn into readable format mm/dd/yyyy
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
-    },
+    {},
     {
       Header: "Last Modified Date",
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: A column ID (or string accessor) is required!

[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:105:28
       Header: "Submission Date",
       accessor: "submissionDate",
       // turn into readable format mm/dd/yyyy
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:109:5
         return formatDate(value);
       },
     },
-    {
-      Header: "Last Modified Date",
-      accessor: "lastModifiedDate",
-      // turn into readable format mm/dd/yyyy
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
-    },
+    {},
     {
       Header: "Completion Date",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:117:5
         return formatDate(value);
       },
     },
-    {
-      Header: "Completion Date",
-      accessor: "completionDate",
-      // turn into readable format mm/dd/yyyy
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
-    },
+    {},
     {
       Header: "Due Date",
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: A column ID (or string accessor) is required!

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:163:19
 
   if (hasRole(currentUser, "ROLE_PROFESSOR")) {
     // if status = PENDING, show Accept and Deny buttons
-    if ((cell) => cell.row.values.status === "PENDING") {
+    if ((cell) => true) {
       columns.push(
         ButtonColumn(

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:163:9
 
   if (hasRole(currentUser, "ROLE_PROFESSOR")) {
     // if status = PENDING, show Accept and Deny buttons
-    if ((cell) => cell.row.values.status === "PENDING") {
+    if (true) {
       columns.push(
         ButtonColumn(

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:173:13
           ),
           ButtonColumn(
             "Deny",
-            "danger",
+            "",
             denyCallback,
             "RecommendationRequestTable",

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:179:14
           )
       )
     }
-    else if ((cell) => cell.row.values.status === "ACCEPTED") {
+    else if (true) {
       columns.push(
         ButtonColumn(

[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:179:63
           )
       )
     }
-    else if ((cell) => cell.row.values.status === "ACCEPTED") {
-      columns.push(
-        ButtonColumn(
-          "Completed",
-          "primary",
-          completeCallback,
-          "RecommendationRequestTable",
-        ),
-        ButtonColumn(
-          "Deny",
-          "danger",
-          denyCallback,
-          "RecommendationRequestTable",
-        )
-      );
-    }
+    else if ((cell) => cell.row.values.status === "ACCEPTED") {}
   }
 

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:182:11
     else if ((cell) => cell.row.values.status === "ACCEPTED") {
       columns.push(
         ButtonColumn(
-          "Completed",
+          "",
           "primary",
           completeCallback,

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:185:11
           "Completed",
           "primary",
           completeCallback,
-          "RecommendationRequestTable",
+          "",
         ),
         ButtonColumn(
