[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {(hasRole(currentUser, "ROLE_PROFESSOR") ||
-                hasRole(currentUser, "ROLE_STUDENT")) && (
-                <>
-                  {hasRole(currentUser, "ROLE_STUDENT") && (
-                    <Nav.Link as={Link} to="/studentprofile">
-                      Student Profile
-                    </Nav.Link>
-                  )}
-                  <Nav.Link as={Link} to="/requests/pending">
-                    Pending Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/completed">
-                    Completed Requests
-                  </Nav.Link>
-                  <Nav.Link as={Link} to="/requests/statistics">
-                    Statistics
-                  </Nav.Link>
-                </>
-              )}
+              {true}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_PROFESSOR")) && (
killedBy: AppNavbar tests renders the three prof pages correctly for professor users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:67:20
               {(hasRole(currentUser, "ROLE_PROFESSOR") ||
                 hasRole(currentUser, "ROLE_STUDENT")) && (
                 <>
-                  {hasRole(currentUser, "ROLE_STUDENT") && (
-                    <Nav.Link as={Link} to="/studentprofile">
-                      Student Profile
-                    </Nav.Link>
-                  )}
+                  {false}
                   <Nav.Link as={Link} to="/requests/pending">
                     Pending Requests
killedBy: AppNavbar tests Student Profile Page shows up when student logged in
statusReason: Error: Unable to find an element with the text: Student Profile. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:83:16
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
-                <>
-                  <Nav.Link as={Link} to="/settings/requesttypes">
-                    Settings
-                  </Nav.Link>
-                </>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppN
