[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:29:18
 
   // Filter requests for professors to only show PENDING and ACCEPTED records
   const pendingRequests = requests?.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
+    (request) => false || request.status === "ACCEPTED",
   ) || [];
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false
