[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:78:16
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
-                <>
-                  <Nav.Link as={Link} to="/settings/requesttypes">
-                    Settings
-                  </Nav.Link>
-                </>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppN
