[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:49:42
 
   // ADDING NEW STATTUS BUTTONS FOR PROFESSORS: Accept and Deny (for PENDING requests), 
   // and Completed (for ACCEPTED requests)
-  const acceptCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "ACCEPTED" });
-    window.location.reload(); // refresh the page
-  };
+  const acceptCallback = async (cell) => {};
 
   const denyCallback = async (cell) => {

[Survived] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:50:33
   // ADDING NEW STATTUS BUTTONS FOR PROFESSORS: Accept and Deny (for PENDING requests), 
   // and Completed (for ACCEPTED requests)
   const acceptCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "ACCEPTED" });
+    statusUpdateMutation.mutate({});
     window.location.reload(); // refresh the page
   };

[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:54:40
     window.location.reload(); // refresh the page
   };
 
-  const denyCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "DENIED" });
-    window.location.reload();
-  };
+  const denyCallback = async (cell) => {};
 
   const completeCallback = async (cell) => {

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:55:52
   };
 
   const denyCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "DENIED" });
+    statusUpdateMutation.mutate({ cell, newStatus: "" });
     window.location.reload();
   };

[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:59:44
     window.location.reload();
   };
 
-  const completeCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "COMPLETED" });
-    window.location.reload();
-  };
+  const completeCallback = async (cell) => {};
 
   const columns = [

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:52
   };
 
   const completeCallback = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "COMPLETED" });
+    statusUpdateMutation.mutate({ cell, newStatus: "" });
     window.location.reload();
   };

[Survived] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:141:47
     );
   }
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR")) {
-    columns.push(
-      ButtonColumn(
-        "Accept",
-        "success",
-        acceptCallback,
-        "RecommendationRequestTable",
-        (cell) => cell.row.values.status === "PENDING"
-      ),
-      ButtonColumn(
-        "Deny",
-        "danger",
-        denyCallback,
-        "RecommendationRequestTable",
-        (cell) => cell.row.values.status === "PENDING"
-      ),
-      ButtonColumn(
-        "Completed",
-        "primary",
-        completeCallback,
-        "RecommendationRequestTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_PROFESSOR")) {}
 
   return (

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:148:19
         "success",
         acceptCallback,
         "RecommendationRequestTable",
-        (cell) => cell.row.values.status === "PENDING"
+        (cell) => false
       ),
       ButtonColumn(

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:148:19
         "success",
         acceptCallback,
         "RecommendationRequestTable",
-        (cell) => cell.row.values.status === "PENDING"
+        (cell) => true
       ),
       ButtonColumn(

[Survived] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:155:9
         "danger",
         denyCallback,
         "RecommendationRequestTable",
-        (cell) => cell.row.values.status === "PENDING"
+        () => undefined
       ),
       ButtonColumn(
