[Killed] StringLiteral
main/components/Nav/AppNavbar.js:62:38
                 </NavDropdown>
               )}
               {(hasRole(currentUser, "ROLE_PROFESSOR") ||
-                hasRole(currentUser, "ROLE_STUDENT")) && (
+                hasRole(currentUser, "")) && (
                 <>
                   {hasRole(currentUser, "ROLE_STUDENT") && (
killedBy: AppNavbar tests renders the three prof pages correctly for student users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:64:20
               {(hasRole(currentUser, "ROLE_PROFESSOR") ||
                 hasRole(currentUser, "ROLE_STUDENT")) && (
                 <>
-                  {hasRole(currentUser, "ROLE_STUDENT") && (
-                    <Nav.Link as={Link} to="/studentprofile">
-                      Student Profile
-                    </Nav.Link>
-                  )}
+                  {true}
                   <Nav.Link as={Link} to="/requests/pending">
                     Pending Requests
killedBy: AppNavbar tests Student Profile Page shows up when student logged in
statusReason: Error: Unable to find an element with the text: Student Profile. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:64:20
               {(hasRole(currentUser, "ROLE_PROFESSOR") ||
                 hasRole(currentUser, "ROLE_STUDENT")) && (
                 <>
-                  {hasRole(currentUser, "ROLE_STUDENT") && (
-                    <Nav.Link as={Link} to="/studentprofile">
-                      Student Profile
-                    </Nav.Link>
-                  )}
+                  {hasRole(currentUser, "ROLE_STUDENT") || <Nav.Link as={Link} to="/studentprofile">
+                      Student Profile
+                    </Nav.Link>}
                   <Nav.Link as={Link} to="/requests/pending">
                     Pending Requests
killedBy: AppNavbar tests Student Profile Page shows up when student logged in
statusReason: Error: Unable to find an element with the text: Student Profile. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:80:16
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
-                <>
-                  <Nav.Link as={Link} to="/settings/requesttypes">
-                    Settings
-                  </Nav.Link>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_PROFESSOR") || <>
+                  <Nav.Link as={Link} to="/settings/requesttypes">
+                    Settings
+                  </Nav.Link>
+                </>}
             </Nav>
 
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppN

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:80:17
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
+              {(hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_PROFESSOR")) && (
                 <>
                   <Nav.Link as={Link} to="/settings/requesttypes">
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppN

[Killed] StringLiteral
main/components/Nav/AppNavbar.js:81:38
                 </>
               )}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
+                hasRole(currentUser, "")) && (
                 <>
                   <Nav.Link as={Link} to="/settings/requesttypes">
killedBy: AppNavbar tests renders the three prof pages correctly for professor users
statusReason: Error: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
