[Killed] ObjectLiteral
main/pages/Requests/PendingRequestsPage.js:20:5
     status: _status,
   } = useBackend(
     [apiEndpoint],
-    {
-      method: "GET",
-      url: apiEndpoint,
-    },
+    {},
     [],
   );
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/Requests/PendingRequestsPage.js:28:27
   );
 
   // Filter requests for professors to only show PENDING and ACCEPTED records
-  const pendingRequests = requests?.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
-  ) || [];
+  const pendingRequests = requests || [];
 
   return (
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] LogicalOperator
main/pages/Requests/PendingRequestsPage.js:28:27
   );
 
   // Filter requests for professors to only show PENDING and ACCEPTED records
-  const pendingRequests = requests?.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
-  ) || [];
+  const pendingRequests = requests?.filter(request => request.status === "PENDING" || request.status === "ACCEPTED") && [];
 
   return (
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:29:18
 
   // Filter requests for professors to only show PENDING and ACCEPTED records
   const pendingRequests = requests?.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
+    (request) => true,
   ) || [];
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:29:18
 
   // Filter requests for professors to only show PENDING and ACCEPTED records
   const pendingRequests = requests?.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
+    (request) => false,
   ) || [];
 
killedBy: PendingRequestsPage tests Renders pending requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
