[Survived] BlockStatement
src/main/utils/RecommendationRequestUtils.js:19:68
 }
 
 // for updating status of recommendation request
-export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {
-  const params = {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-      details: cell.row.values.details || ""
-    }
-  };
-
-  return params;
-}
+export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {}
 

[Survived] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:20:18
 
 // for updating status of recommendation request
 export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {
-  const params = {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-      details: cell.row.values.details || ""
-    }
-  };
+  const params = {};
 
   return params;

[Survived] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:26:11
     params: {
       id: cell.row.values.id,
     },
-    data: {
-      status: newStatus,
-      details: cell.row.values.details || ""
-    }
+    data: {}
   };
 

[Survived] LogicalOperator
src/main/utils/RecommendationRequestUtils.js:28:16
     },
     data: {
       status: newStatus,
-      details: cell.row.values.details || ""
+      details: cell.row.values.details && ""
     }
   };

[Survived] ConditionalExpression
src/main/utils/RecommendationRequestUtils.js:28:16
     },
     data: {
       status: newStatus,
-      details: cell.row.values.details || ""
+      details: false
     }
   };
