[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:106:14
                 </option>
               )}
             </Form.Select>
-            {errors.professor_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.professor_id.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.professor_id || <Form.Control.Feedback type="invalid">
+                {errors.professor_id.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
