[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:15:34
 export default function RequestTypeTable({ requesttype, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/requesttypes/create/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requesttypes/create/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
main/components/RequestType/RequestTypeTable.js:38:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-    {
-      Header: "Request Type",
-      accessor: "requestType",
-    },
-  ];
+  const columns = [];
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:44:15
       accessor: "id", // accessor is the "key" in the data
     },
     {
-      Header: "Request Type",
+      Header: "",
       accessor: "requestType",
     },
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Request Type. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:50:42
   ];
 
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
-  if (hasRole(currentUser, "ROLE_USER")) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_USER")) {}
 
   if (
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:52:30
   //since all admins have the role of a user, we can just check if the current user has the role ROLE_USER
   if (hasRole(currentUser, "ROLE_USER")) {
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
+      ButtonColumn("Delete", "", deleteCallback, "RequestTypeTable"),
     );
   }
killedBy: UserTable tests Delete button has correct styling (danger variant)
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] LogicalOperator
main/components/RequestType/RequestTypeTable.js:57:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    (hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_PROFESSOR"))
+    hasRole(currentUser, "ROLE_USER") || hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_PROFESSOR")
   ) {
     columns.push(
killedBy: UserTable tests Edit button is not shown to users with ROLE_STUDENT
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RequestTypeTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:57:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_USER") &&
-    (hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_PROFESSOR"))
+    false
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:58:6
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    (hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_PROFESSOR"))
+    (true)
   ) {
     columns.push(
killedBy: UserTable tests Edit button is not shown to users with ROLE_STUDENT
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RequestTypeTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] LogicalOperator
main/components/RequestType/RequestTypeTable.js:58:6
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    (hasRole(currentUser, "ROLE_ADMIN") ||
-      hasRole(currentUser, "ROLE_PROFESSOR"))
+    (hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_PROFESSOR"))
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:60:5
     hasRole(currentUser, "ROLE_USER") &&
     (hasRole(currentUser, "ROLE_ADMIN") ||
       hasRole(currentUser, "ROLE_PROFESSOR"))
-  ) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:70:15
     <OurTable
       data={requesttype}
       columns={columns}
-      testid={"RequestTypeTable"}
+      testid={""}
     />
   );
killedBy: UserTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
