[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:15:33
 
 // format date helper function
 // stryker disable next-line all : dont test this function
-function formatDate(dateString) {
-  if (!dateString) return "";
-  return new Date(dateString).toLocaleDateString();
-}
+function formatDate(dateString) {}
 
 export default function RecommendationRequestTable({ requests, currentUser }) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:16:7
 // format date helper function
 // stryker disable next-line all : dont test this function
 function formatDate(dateString) {
-  if (!dateString) return "";
+  if (true) return "";
   return new Date(dateString).toLocaleDateString();
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:16:7
 // format date helper function
 // stryker disable next-line all : dont test this function
 function formatDate(dateString) {
-  if (!dateString) return "";
+  if (dateString) return "";
   return new Date(dateString).toLocaleDateString();
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:69:15
       accessor: "requester.email",
     },
     {
-      Header: "Recommendation Type",
+      Header: "",
       accessor: "recommendationType",
     },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Recommendation Type. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:74:17
     },
     {
       Header: "Details",
-      accessor: "details",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-details"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:85:28
       accessor: "submissionDate",
 
       // turning into a readable date format mm/dd/yyyy
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:91:17
     },
     {
       Header: "Last Modified Date",
-      accessor: "lastModifiedDate",
+      accessor: "",
 
       Cell: ({ value }) => {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-lastModifiedDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:93:28
       Header: "Last Modified Date",
       accessor: "lastModifiedDate",
 
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  6/2/2022
Received:

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:105:5
         return formatDate(value);
       },
     },
-    {
-      Header: "Due Date",
-      accessor: "dueDate",
-
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
-    },
+    {},
   ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:129:27
 
   if (
     hasRole(currentUser, "ROLE_USER") &&
-    !hasRole(currentUser, "ROLE_ADMIN")
+    !hasRole(currentUser, "")
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead
