[Killed] StringLiteral
main/pages/Requests/PendingRequestsPage.js:14:7
   // and regular users can see all requests they've made
   const apiEndpoint = hasRole(currentUser, "ROLE_PROFESSOR")
     ? "/api/recommendationrequest/professor/all"
-    : "/api/recommendationrequest/requester/all";
+    : "";
 
   const {
killedBy: PendingRequestsPage tests Renders pending and accepted requests for student
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/Requests/PendingRequestsPage.js:33:27
   );
 
   // filter requests such that only status = PENDING or ACCEPTED records are shown
-  const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
-  );
+  const pendingRequests = requests;
 
   return (
killedBy: PendingRequestsPage tests Renders pending and accepted requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
main/pages/Requests/PendingRequestsPage.js:34:18
 
   // filter requests such that only status = PENDING or ACCEPTED records are shown
   const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
+    (request) => request.status !== "PENDING" || request.status === "ACCEPTED",
   );
 
killedBy: PendingRequestsPage tests Renders pending and accepted requests for professor
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
main/pages/Requests/PendingRequestsPage.js:34:18
 
   // filter requests such that only status = PENDING or ACCEPTED records are shown
   const pendingRequests = requests.filter(
-    (request) => request.status === "PENDING" || request.status === "ACCEPTED",
+    (request) => false,
   );
 
killedBy: PendingRequestsPage tests Renders pending and accepted requests for professor
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
