[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:14:33
 
 // format date helper function
 // stryker disable next-line all : dont test this function
-function formatDate(dateString) {
-  return new Date(dateString).toLocaleDateString();
-}
+function formatDate(dateString) {}
 
 export default function RecommendationRequestTable({ requests, currentUser }) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1/2/2022
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:88:28
     {
       Header: "Last Modified Date",
       accessor: "lastModifiedDate",
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  6/2/2022
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:95:28
     {
       Header: "Completion Date",
       accessor: "completionDate",
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  6/2/2022
Received:

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:102:28
     {
       Header: "Due Date",
       accessor: "dueDate",
-      Cell: ({ value }) => {
-        return formatDate(value);
-      },
+      Cell: ({ value }) => {},
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  9/2/2022
Received:
