[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:47:52
 
   // Stryker disable next-line all : TODO try to make a good test for this
   const acceptCallBack = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "ACCEPTED" });
+    statusUpdateMutation.mutate({ cell, newStatus: "" });
     window.location.reload(); // refresh the page to see update
   };
killedBy: UserTable tests Accept button calls accept callback (professor) and updates status to accepted
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "{\"status\":\"ACCEPTED\"}"
Received: "{\"status\":\"\"}"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:47:33
 
   // Stryker disable next-line all : TODO try to make a good test for this
   const acceptCallBack = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "ACCEPTED" });
+    statusUpdateMutation.mutate({});
     window.location.reload(); // refresh the page to see update
   };
killedBy: UserTable tests Accept button calls accept callback (professor) and updates status to accepted
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:53:33
 
   // Stryker disable next-line all : TODO try to make a good test for this
   const denyCallBack = async (cell) => {
-    statusUpdateMutation.mutate({ cell, newStatus: "DENIED" });
+    statusUpdateMutation.mutate({});
     window.location.reload(); // refresh the page to see update
   };
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:100:5
       Header: "Submission Date",
       accessor: "submissionDate",
     },
-    {
-      Header: "Last Modified Date",
-      accessor: "lastModifiedDate",
-    },
+    {},
     {
       Header: "Completion Date",
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:140:7
     );
   }
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR")) {
+  if (true) {
     columns.push(
       ButtonColumn(
killedBy: UserTable tests Accept, Deny, Complete buttons are only shown for users with ROLE_PROFESSOR
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="RecommendationRequestTable-cell-row-0-col-Accept-button" type="button">Accept</button> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:140:7
     );
   }
 
-  if (hasRole(currentUser, "ROLE_PROFESSOR")) {
+  if (false) {
     columns.push(
       ButtonColumn(
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Deny-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:143:9
   if (hasRole(currentUser, "ROLE_PROFESSOR")) {
     columns.push(
       ButtonColumn(
-        "Accept",
+        "",
         "success",
         acceptCallBack,
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:144:9
     columns.push(
       ButtonColumn(
         "Accept",
-        "success",
+        "",
         acceptCallBack,
         "RecommendationRequestTable",
killedBy: UserTable tests Accept button calls accept callback (professor) and updates status to accepted
statusReason: Error: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:148:19
         acceptCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only accept pending requests
-        (cell) => cell.row.values.status === "PENDING",
+        (cell) => false,
       ),
       ButtonColumn(

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestTable.js:148:19
         acceptCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only accept pending requests
-        (cell) => cell.row.values.status === "PENDING",
+        (cell) => true,
       ),
       ButtonColumn(

[Survived] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:156:9
         denyCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only deny pending requests
-        (cell) => cell.row.values.status === "PENDING",
+        () => undefined,
       ),
       ButtonColumn(

[Survived] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:156:19
         denyCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only deny pending requests
-        (cell) => cell.row.values.status === "PENDING",
+        (cell) => cell.row.values.status !== "PENDING",
       ),
       ButtonColumn(

[Survived] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestTable.js:164:19
         completedCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only complete accepted requests
-        (cell) => cell.row.values.status === "ACCEPTED",
+        (cell) => cell.row.values.status !== "ACCEPTED",
       ),
     );

[Survived] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:164:9
         completedCallBack,
         "RecommendationRequestTable",
         // stryker disable next-line all : professor can only complete accepted requests
-        (cell) => cell.row.values.status === "ACCEPTED",
+        () => undefined,
       ),
     );
