[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:19:68
 }
 
 // for updating status of recommendation request
-export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {
-  const params = {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-    },
-  };
-  return params;
-}
+export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {}
 
 export function onStatusUpdateSuccess(message) {
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:20:18
 
 // for updating status of recommendation request
 export function cellToAxiosParamsUpdateStatus({ cell, newStatus }) {
-  const params = {
-    url: "/api/recommendationrequest/professor",
-    method: "PUT",
-    params: {
-      id: cell.row.values.id,
-    },
-    data: {
-      status: newStatus,
-    },
-  };
+  const params = {};
   return params;
 }
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:26:11
     params: {
       id: cell.row.values.id,
     },
-    data: {
-      status: newStatus,
-    },
+    data: {},
   };
   return params;
killedBy: UserTable tests Denied button calls deny callback (professor) and updates status to denied
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "{\"status\":\"DENIED\"}"
Received: "{}"

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:33:48
   return params;
 }
 
-export function onStatusUpdateSuccess(message) {
-  console.log(message);
-  toast(message);
-}
+export function onStatusUpdateSuccess(message) {}
 
killedBy: RecommendationRequestUtils onStatusUpdateSuccess It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "abc"

Number of calls: 0
