[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:88:5
       accessor: "completionDate",
       Cell: ({ value }) => dateutils.formatdate(value),
     },
-    {
-      Header: "Due Date",
-      accessor: "dueDate",
-      Cell: ({ value }) => dateutils.formatdate(value),
-    },
+    {},
   ];
 
killedBy: StudentProfilePage tests renders correctly for student user
statusReason: Error: A column ID (or string accessor) is required!
