[Killed] BlockStatement
src/main/pages/AdminRequestsPage.js:7:33
 import { useBackend } from "main/utils/useBackend";
 import { useCurrentUser } from "main/utils/currentUser";
 
-const AdminRequestsPage = () => {
-  const { data: currentUser } = useCurrentUser();
-  const {
-    data: all,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/recommendationrequest/admin/all"],
-    { method: "GET", url: "/api/recommendationrequest/admin/all" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>All Requests</h2>
-      <RecommendationRequestTable requests={all} currentUser={currentUser} />
-    </BasicLayout>
-  );
-};
+const AdminRequestsPage = () => {};
 
 export default AdminRequestsPage;
killedBy: AdminRequestsPage tests renders without crashing on three users
statusReason: Error: Unable to find an element with the text: All Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ObjectLiteral
src/main/pages/AdminRequestsPage.js:16:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequest/admin/all"],
-    { method: "GET", url: "/api/recommendationrequest/admin/all" },
+    {},
     [],
   );
killedBy: AdminRequestsPage tests renders empty table when backend unavailable
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendationrequest/admin/all"
Received string:    "Error communicating with backend via undefined on undefined"

[Killed] StringLiteral
src/main/pages/AdminRequestsPage.js:16:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequest/admin/all"],
-    { method: "GET", url: "/api/recommendationrequest/admin/all" },
+    { method: "", url: "/api/recommendationrequest/admin/all" },
     [],
   );
killedBy: AdminRequestsPage tests renders empty table when backend unavailable
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendationrequest/admin/all"
Received string:    "Error communicating with backend via  on /api/recommendationrequest/admin/all"
