[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:48:5
       Header: "Professor Name",
       accessor: "professor.fullName",
     },
-    {
-      Header: "Professor Email",
-      accessor: "professor.email",
-    },
+    {},
     {
       Header: "Requester Name",
killedBy: CompletedRequestsPage tests Renders completed and denied requests for professor
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:56:5
       Header: "Requester Name",
       accessor: "requester.fullName",
     },
-    {
-      Header: "Requester Email",
-      accessor: "requester.email",
-    },
+    {},
     {
       Header: "Recommendation Type",
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:74:17
     },
     {
       Header: "Submission Date",
-      accessor: "submissionDate",
+      accessor: "",
       Cell: ({ value }) => dateutils.formatdate(value),
     },
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-submissionDate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:75:13
     {
       Header: "Submission Date",
       accessor: "submissionDate",
-      Cell: ({ value }) => dateutils.formatdate(value),
+      Cell: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:80:13
     {
       Header: "Last Modified Date",
       accessor: "lastModifiedDate",
-      Cell: ({ value }) => dateutils.formatdate(value),
+      Cell: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  06/02/2022 12:00
Received:

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:85:13
     {
       Header: "Completion Date",
       accessor: "completionDate",
-      Cell: ({ value }) => dateutils.formatdate(value),
+      Cell: () => undefined,
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  06/02/2022 12:00
Received:

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:90:13
     {
       Header: "Due Date",
       accessor: "dueDate",
-      Cell: ({ value }) => dateutils.formatdate(value),
+      Cell: () => undefined,
     },
   ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  09/02/2022 12:00
Received:
