[Killed] OptionalChaining
main/components/RequestType/RequestTypeForm.js:54:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.requestType?.message}
+          {errors.requestType.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: RequestTypeForm tests that submitAction is called when Submit is clicked
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
