[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:46:5
 
   //Only admins and professors should be able to see and use the delete and edit buttons
   if (
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_PROFESSOR")
+    false
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content (ADMIN)
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] LogicalOperator
main/components/RequestType/RequestTypeTable.js:46:5
 
   //Only admins and professors should be able to see and use the delete and edit buttons
   if (
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_PROFESSOR")
+    hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_PROFESSOR")
   ) {
     columns.push(
killedBy: UserTable tests Has the expected column headers and content (ADMIN)
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:47:26
   //Only admins and professors should be able to see and use the delete and edit buttons
   if (
     hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_PROFESSOR")
+    hasRole(currentUser, "")
   ) {
     columns.push(
killedBy: UserTable tests Delete button calls delete callback (PROFESSOR)
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:48:5
   if (
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_PROFESSOR")
-  ) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   if (
killedBy: UserTable tests Has the expected column headers and content (ADMIN)
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/components/RequestType/RequestTypeTable.js:50:20
     hasRole(currentUser, "ROLE_PROFESSOR")
   ) {
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
+      ButtonColumn("", "danger", deleteCallback, "RequestTypeTable"),
     );
   }
killedBy: UserTable tests Has the expected column headers and content (ADMIN)
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/RequestType/RequestTypeTable.js:55:5
   }
 
   if (
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    hasRole(currentUser, "ROLE_PROFESSOR")
+    true
   ) {
     columns.push(
killedBy: UserTable tests A user with no roles has expected content
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="RequestTypeTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:57:5
   if (
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_PROFESSOR")
-  ) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests Has the expected column headers and content (ADMIN)
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null
