[Killed] BlockStatement
main/pages/Requests/PendingRequestsPage.js:3:47
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function PendingRequestsPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Pending Requests page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function PendingRequestsPage() {}
 
killedBy: PendingRequestsPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Pending Requests page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
