[Killed] BlockStatement
src/main/pages/StudentProfilePage.js:28:46
     [],
   );
 
-  if (!hasRole(currentUser, "ROLE_STUDENT")) {
-    return <p>Students only.</p>;
-  }
+  if (!hasRole(currentUser, "ROLE_STUDENT")) {}
 
   const { email, pictureUrl, fullName } = currentUser.root.user;
killedBy: StudentProfilePage tests renders correctly for student user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ConditionalExpression
src/main/pages/StudentProfilePage.js:28:7
     [],
   );
 
-  if (!hasRole(currentUser, "ROLE_STUDENT")) {
+  if (false) {
     return <p>Students only.</p>;
   }
killedBy: StudentProfilePage tests renders correctly for student user
statusReason: TypeError: Cannot read properties of null (reading 'user')
