[Killed] BlockStatement
src/main/utils/dateutils.js:1:35
-export function formatdate(value) {
-  var month = value.substring(5, 7);
-  var day = value.substring(8, 10);
-  var year = value.substring(0, 4);
-  var hours = value.substring(11, 13);
-  var minutes = value.substring(14, 16);
-  return `${month}/${day}/${year} ${hours}:${minutes}`;
-}
+export function formatdate(value) {}
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:

[Killed] MethodExpression
src/main/utils/dateutils.js:2:15
 export function formatdate(value) {
-  var month = value.substring(5, 7);
+  var month = value;
   var day = value.substring(8, 10);
   var year = value.substring(0, 4);
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
  2022-01-02T12:00/02/2022 12:00

[Killed] MethodExpression
src/main/utils/dateutils.js:3:13
 export function formatdate(value) {
   var month = value.substring(5, 7);
-  var day = value.substring(8, 10);
+  var day = value;
   var year = value.substring(0, 4);
   var hours = value.substring(11, 13);
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
  01/2022-01-02T12:00/2022 12:00

[Killed] MethodExpression
src/main/utils/dateutils.js:4:14
 export function formatdate(value) {
   var month = value.substring(5, 7);
   var day = value.substring(8, 10);
-  var year = value.substring(0, 4);
+  var year = value;
   var hours = value.substring(11, 13);
   var minutes = value.substring(14, 16);
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
  01/02/2022-01-02T12:00 12:00

[Killed] MethodExpression
src/main/utils/dateutils.js:5:15
   var month = value.substring(5, 7);
   var day = value.substring(8, 10);
   var year = value.substring(0, 4);
-  var hours = value.substring(11, 13);
+  var hours = value;
   var minutes = value.substring(14, 16);
   return `${month}/${day}/${year} ${hours}:${minutes}`;
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
  01/02/2022 2022-01-02T12:00:00

[Killed] MethodExpression
src/main/utils/dateutils.js:6:17
   var day = value.substring(8, 10);
   var year = value.substring(0, 4);
   var hours = value.substring(11, 13);
-  var minutes = value.substring(14, 16);
+  var minutes = value;
   return `${month}/${day}/${year} ${hours}:${minutes}`;
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
  01/02/2022 12:2022-01-02T12:00

[Killed] StringLiteral
src/main/utils/dateutils.js:7:10
   var year = value.substring(0, 4);
   var hours = value.substring(11, 13);
   var minutes = value.substring(14, 16);
-  return `${month}/${day}/${year} ${hours}:${minutes}`;
+  return ``;
 }
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  01/02/2022 12:00
Received:
